In [2]:
import pandas as pd
import numpy as np

In [8]:
gross = pd.read_csv('data/bom.movie_gross.csv.gz', compression='gzip', error_bad_lines=False)

gross.head(3)

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010

In [9]:
basics = pd.read_csv('data/imdb.title.basics.csv.gz', compression='gzip', error_bad_lines=False)

basics.head(3)

,tconst,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama

In [17]:
gross['foreign_gross'] = pd.to_numeric(gross['foreign_gross'],errors='coerce')
gross['total_gross'] = gross['domestic_gross'] + gross['foreign_gross']

top_100 = gross.sort_values('total_gross', ascending=False)[:100][['title', 'total_gross']]

In [19]:
top_100.head(10)

                                            title   total_gross
727                         Marvel's The Avengers  1.518900e+09
1875                      Avengers: Age of Ultron  1.405400e+09
3080                                Black Panther  1.347000e+09
328   Harry Potter and the Deathly Hallows Part 2  1.341500e+09
2758                     Star Wars: The Last Jedi  1.332600e+09
3081               Jurassic World: Fallen Kingdom  1.309500e+09
1127                                       Frozen  1.276400e+09
2759                  Beauty and the Beast (2017)  1.263500e+09
3082                                Incredibles 2  1.242800e+09
1128                                   Iron Man 3  1.214800e+09

In [24]:
top_100_w_genres = top_100.join(basics.set_index('primary_title'), how='left', on='title' )[['title', 'total_gross', 'genres']]
top_100_w_genres = top_100_w_genres[top_100_w_genres['title'].duplicated() == False]

In [25]:
top_100_w_genres.head(10)

,title,total_gross,genres
727,Marvel's The Avengers,1.518900e+09,NaN
1875,Avengers: Age of Ultron,1.405400e+09,"Action,Adventure,Sci-Fi"
3080,Black Panther,1.347000e+09,"Action,Adventure,Sci-Fi"
328,Harry Potter and the Deathly Hallows Part 2,1.341500e+09,NaN
2758,Star Wars: The Last Jedi,1.332600e+09,"Action,Adventure,Fantasy"
3081,Jurassic World: Fallen Kingdom,1.309500e+09,"Action,Adventure,Sci-Fi"
1127,Frozen,1.276400e+09,"Adventure,Drama,Sport"
2759,Beauty and the Beast (2017),1.263500e+09,NaN
3082,Incredibles 2,1.242800e+09,"Action,Adventure,Animation"
1128,Iron Man 3,1.214800e+09,"Action,Adventure,Sci-Fi"

In [33]:
name_prob = top_100_w_genres[top_100_w_genres['genres'].isna()]
name_prob.head()
name_prob.shape

(13, 3)

In [34]:
import difflib

In [47]:
word_list = ['Star Wasr', 'Straw Wall','Star Trek','Stupid Wars']
str_we_want = 'Star Wars'
matches = difflib.get_close_matches(str_we_want, word_list, n=3, cutoff=0.6)
print(matches)

['Star Wasr', 'Stupid Wars', 'Star Trek']

In [36]:
difflib.get_close_matches("Marvel's The Avengers", basics['primary_title'], n=1)

['The Avengers']

In [48]:
for i in name_prob.index:
    try:
        best_match = difflib.get_close_matches(top_100.loc[i, 'title'], basics['primary_title'], n=1)
        top_100.loc[i, 'title'] = best_match[0] 
    except:
        top_100.loc[i, 'title'] = top_100.loc[i, 'title']

In [55]:
top_100.head(10)

                                             title   total_gross
727                                   The Avengers  1.518900e+09
1875                       Avengers: Age of Ultron  1.405400e+09
3080                                 Black Panther  1.347000e+09
328   Harry Potter and the Deathly Hallows: Part 2  1.341500e+09
2758                      Star Wars: The Last Jedi  1.332600e+09
3081                Jurassic World: Fallen Kingdom  1.309500e+09
1127                                        Frozen  1.276400e+09
2759                          Beauty and the Beast  1.263500e+09
3082                                 Incredibles 2  1.242800e+09
1128                                    Iron Man 3  1.214800e+09

In [56]:
finished = top_100.join(basics.set_index('primary_title'), how='left', on='title' )[['title', 'total_gross', 'genres']]
finished = finished[finished['title'].duplicated() == False]

In [57]:
display(finished.head(10))

,title,total_gross,genres
727,The Avengers,1.518900e+09,"Action,Adventure,Sci-Fi"
1875,Avengers: Age of Ultron,1.405400e+09,"Action,Adventure,Sci-Fi"
3080,Black Panther,1.347000e+09,"Action,Adventure,Sci-Fi"
328,Harry Potter and the Deathly Hallows: Part 2,1.341500e+09,"Adventure,Drama,Fantasy"
2758,Star Wars: The Last Jedi,1.332600e+09,"Action,Adventure,Fantasy"
3081,Jurassic World: Fallen Kingdom,1.309500e+09,"Action,Adventure,Sci-Fi"
1127,Frozen,1.276400e+09,"Adventure,Drama,Sport"
2759,Beauty and the Beast,1.263500e+09,"Drama,Fantasy,Romance"
3082,Incredibles 2,1.242800e+09,"Action,Adventure,Animation"
1128,Iron Man 3,1.214800e+09,"Action,Adventure,Sci-Fi"

In [58]:
finished['genres'].isna().sum()

2

In [59]:
finished[finished['genres'].isna() == True]

      title  total_gross genres
2768   Coco  807100000.0    NaN
736   MIB 3  624000000.0    NaN

In [60]:
finished['genres'].fillna('Missing', inplace=True)